{
  "backend/main.mo": "Motoko canister defining agents, leads, owners, follow‑ups, user profiles, and approval logic with authorization and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report listing themed UI changes, affected files, involved components, and requirement IDs.",
  "frontend-file-summaries.txt": "Text file mapping frontend source paths to brief human‑written summaries of their purpose and styling version.",
  "frontend/index.css": "Global Tailwind base and theme token definitions using OKLCH variables for light and dark modes.",
  "frontend/index.html": "HTML entry point loading Inter font and bootstrapping the React app root.",
  "frontend/src/App.tsx": "Main router setup with protected, admin, and agent route guards and dashboard routing logic.",
  "frontend/src/components/auth/AgentRegistrationForm.tsx": "Agent registration dialog handling form input, photo upload, validation, and submission via React Query.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main layout with header, role-based theming, logout handling, and footer for all pages.",
  "frontend/src/components/theme/PageTheme.tsx": "Applies a page-level CSS theme class based on the given variant.",
  "frontend/src/components/whatsapp/WhatsAppLinkButton.tsx": "Renders a WhatsApp button that opens a prefilled chat message to a specified mobile number.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor, refreshing it on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, identity persistence, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls with React Query hooks for user profiles, roles, agents, and related mutations.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive CSS variables for light/dark themes and page-level theming.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AccessDeniedPage.tsx": "Displays themed access denial messages with reason-specific details and a logout option.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Provides the admin dashboard layout with tabbed panels for overview, agents, data, follow-ups, and export tools.",
  "frontend/src/pages/admin/AgentDetailPage.tsx": "Displays detailed agent information, status, and lead performance with loading and not-found handling.",
  "frontend/src/pages/admin/panels/AdminOverviewPanel.tsx": "Shows admin metrics such as leads, agents, revenue, and follow-ups, including charts and loading states.",
  "frontend/src/pages/admin/panels/AgentManagementPanel.tsx": "Allows admins to view, create, and manage agent accounts, including status updates and photo uploads.",
  "frontend/src/pages/admin/panels/ExportCenterPanel.tsx": "Exports agents, leads, and owner data to CSV or Excel using utility download functions.",
  "frontend/src/pages/admin/panels/GlobalFollowUpsPanel.tsx": "Displays all follow-ups segmented into pending, overdue, and completed with filtering, status badges, and loading state.",
  "frontend/src/pages/admin/panels/MasterDataPanel.tsx": "Provides CRUD management for leads and owners with tabs, dialogs, and form handling.",
  "frontend/src/pages/agent/AgentDashboardPage.tsx": "Renders the agent dashboard with tabs for overview, lead/owner creation, and follow-up tracking.",
  "frontend/src/pages/agent/panels/AddLeadOwnerPanel.tsx": "Allows agents to create leads and owners and view their own lead and owner lists.",
  "frontend/src/pages/agent/panels/AgentOverviewPanel.tsx": "Shows agent-specific metrics including counts of leads, owners, and today's follow-ups with loading handling.",
  "frontend/src/pages/agent/panels/FollowUpTrackerPanel.tsx": "Enables agents to view, create, and edit follow-ups with forms, dialogs, and status indicators.",
  "frontend/src/pages/LoginPage.tsx": "Handles user login via Internet Identity, profile setup, and routing based on admin or agent roles.",
  "frontend/src/utils/downloads.ts": "Provides CSV and Excel file download utilities that generate files from array data.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL and hash params, persist them in sessionStorage, and clear them from the hash.",
  "frontend/tailwind.config.js": "Defines TailwindCSS config with custom colors, radius, shadows, dark mode, and animation/typography plugins.",
  "project_state.json": "Stores project metadata, feature summaries, architecture notes, and current state for a VR Homes CRM system."
}