{
  "backend/main.mo": "Defines actors, types, authorization, user profiles, approval logic, and CRUD state maps for agents, leads, owners, and follow-ups.",
  "feature_evidence.json": "Describes feature evidence linking a UI update to affected frontend files, components, and test requirements.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for multiple frontend files across hooks, components, and pages.",
  "frontend/index.css": "Tailwind base styles and OKLCH color tokens defining light and dark theme variables.",
  "frontend/index.html": "HTML entry point that loads the React app root and main.tsx script.",
  "frontend/src/App.tsx": "Configures TanStack Router, protected routes, and role-based admin/agent access logic.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper providing header, footer, user greeting, and logout handling for admin and agent dashboards.",
  "frontend/src/components/whatsapp/WhatsAppLinkButton.tsx": "Button component that opens a WhatsApp chat with a prefilled message for a given contact.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the authenticated backend actor and refreshes dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, stored identities, and related auth state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, roles, agents, and leads via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup with theme variables, dark mode tokens, and custom styles for a colorful login page.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClientProvider and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/AccessDeniedPage.tsx": "Displays an access-denied message based on reason and provides a logout button that clears identity and cache.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Renders the admin dashboard with tabbed panels for overview, agents, master data, follow-ups, and reports.",
  "frontend/src/pages/admin/AgentDetailPage.tsx": "Shows detailed agent info and lead stats, including conversion rate, with loading and not-found handling.",
  "frontend/src/pages/admin/panels/AdminOverviewPanel.tsx": "Displays admin statistics for leads, agents, revenue, and follow-ups with a sales vs rent chart, fetching data via queries.",
  "frontend/src/pages/admin/panels/AgentManagementPanel.tsx": "Provides CRUD and status management for agents, including creation with photo upload and a table of existing agents.",
  "frontend/src/pages/admin/panels/ExportCenterPanel.tsx": "Exports agents, leads, and owners as CSV or Excel files using mapped data and download utilities.",
  "frontend/src/pages/admin/panels/GlobalFollowUpsPanel.tsx": "Shows all follow-ups split into pending, overdue, and completed tabs with status badges and timestamps.",
  "frontend/src/pages/admin/panels/MasterDataPanel.tsx": "Manages creation, editing, and deletion of lead and owner records with dialog-based forms and tabbed views.",
  "frontend/src/pages/agent/AgentDashboardPage.tsx": "Renders the agent dashboard with tabs for overview, data management, and follow-up tracking panels.",
  "frontend/src/pages/agent/panels/AddLeadOwnerPanel.tsx": "Provides UI and logic for agents to create leads and property owners, plus view their existing leads and owners via tabbed panels.",
  "frontend/src/pages/agent/panels/AgentOverviewPanel.tsx": "Displays an agent dashboard summarizing counts of leads, owners, and today's pending follow-ups.",
  "frontend/src/pages/agent/panels/FollowUpTrackerPanel.tsx": "Allows agents to view, create, and edit follow-ups for leads, including status handling and date-based indicators.",
  "frontend/src/pages/LoginPage.tsx": "Handles Internet Identity login, user role/profile checks, and profile setup with a stylized gradient UI.",
  "frontend/src/utils/downloads.ts": "Utility functions to export data arrays as CSV or Excel files using client-side blob downloads.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters and session-stored values, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, themes, animations, and plugins like typography and container queries.",
  "project_state.json": "Describes the project’s schema, features, and architecture for a VR Homes CRM with RBAC, unified login, dashboards, data rules, and exports. Lists existing features, core entities, and architectural requirements without known issues."
}