{
  "kind": "build_request",
  "title": "Update session setup failure wording and rearrange Admin/Agent dashboard panels",
  "projectName": "VR Homes Infra CRM",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-34",
      "text": "Update the Login page session-initialization failure UI so the user-facing copy matches the user request: show the failure message as \"Session Setup failed, kindly refresh it.\" and update the primary action label to a refresh-oriented label (e.g., \"Refresh\" / \"Refresh this\") while keeping the existing reload behavior unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "\"Session Setup failed \" refresh this."
        ]
      },
      "acceptanceCriteria": [
        "When the app is in the existing session setup failure state (identity exists, actor is not created, and actor is not fetching) in frontend/src/pages/LoginPage.tsx, the description text displayed to users is exactly: \"Session Setup failed, kindly refresh it.\"",
        "The primary button in this state clearly communicates refreshing (label uses English and matches the intent \"refresh this\") and still triggers a full page reload (window.location.reload()).",
        "No authentication logic, routing logic, or actor initialization logic is changed—only the user-facing text/labels in the failure UI."
      ]
    },
    {
      "id": "REQ-35",
      "text": "Rearrange (move) the dashboard panels in both Admin Dashboard and Agent Dashboard by changing the tab order and layout so all panels are clearly reachable and appear in the requested arrangement, without removing any existing panels or changing their functionality.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Kindly move those panels  both of Admin dashboard and agent dashboard."
        ]
      },
      "acceptanceCriteria": [
        "Admin dashboard tabs in frontend/src/pages/admin/AdminDashboardPage.tsx are reordered to a clearer, intentional sequence (keep all existing tabs: Overview, Agents, Master Data, Follow-Ups, Export; only their placement/order changes).",
        "Agent dashboard tabs in frontend/src/pages/agent/AgentDashboardPage.tsx are reordered to a clearer, intentional sequence (keep all existing tabs: Overview, Leads & Owners, Follow-ups; only their placement/order changes).",
        "All tab content still renders the same existing panel components (no panel is removed or replaced).",
        "Tab bar remains responsive (wraps as needed) and all labels remain in English."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be modified (including frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and frontend/src/components/ui sources).",
    "Keep all existing authentication/onboarding/routing behavior unchanged; only adjust user-facing text and dashboard panel placement/order.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Adding new dashboard panels or new routes.",
    "Changing backend data models, authorization, or APIs.",
    "Implementing drag-and-drop panel customization (only reorder/move existing panels as part of the fixed layout)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}