{
  "kind": "build_request",
  "title": "Make Login Page and Headings More Colorful",
  "projectName": "VR Homes Infra CRM",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-22",
      "text": "Update the Login page theme styling to be clearly more colorful while keeping all existing login behavior unchanged (Internet Identity sign-in, Admin/Agent toggle, loading state, profile setup dialog, and agent registration dialog). This must be implemented via theme tokens/CSS and existing components so the layout and logic remain the same.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Make the colourfull the headings / login page also should be colourful"
        ]
      },
      "acceptanceCriteria": [
        "Login screen background (PageTheme variant=\"login\") renders a visibly colorful background (e.g., gradient) in both light and dark mode with no white/un-styled gaps around the viewport.",
        "All existing Login page user flows remain unchanged: Admin/Agent toggle still works, Internet Identity sign-in still works, loading screen still appears, profile setup dialog still appears when required, and agent registration dialog still appears when applicable.",
        "The Login card content remains readable over the new colorful background (text contrast is acceptable in light and dark modes)."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Make primary headings across the app (e.g., page titles and section headers) more colorful and higher-contrast using a consistent theme-driven style, including the Login page title and the Admin/Agent dashboard titles, without changing any page structure or text content.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Make the colourfull the headings / login page also should be colourful"
        ]
      },
      "acceptanceCriteria": [
        "Login page title (\"VR Homes Infra CRM\") and dashboard titles (e.g., \"Admin Dashboard\", \"Agent Dashboard\") use a visibly more colorful heading style (e.g., accent/gradient text or accent underline) driven by theme tokens (not hard-coded one-off colors).",
        "Heading styling remains readable and consistent in both light and dark mode (no low-contrast heading text).",
        "No changes to routing, authentication logic, backend calls, or role/status enforcement are introduced by the heading styling updates."
      ]
    }
  ],
  "constraints": [
    "Do not change any authentication/onboarding behavior or routing logic; changes must be styling/theme only.",
    "Do not edit any frontend immutable paths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*).",
    "Use English for all user-facing text (do not introduce non-English strings)."
  ],
  "nonGoals": [
    "Backend changes (Motoko actor APIs, state, or authorization rules).",
    "Adding new pages, new roles, or altering Admin/Agent access rules.",
    "Introducing new third-party UI libraries or changing the routing/layout structure."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}