{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update session setup failure copy and reorder Admin/Agent dashboard tabs",
  "requirements": [
    {
      "id": "REQ-34",
      "summary": "Adjust the session setup failure UI copy on the Login page to match the requested wording and make the primary action explicitly refresh-oriented while keeping reload behavior unchanged.",
      "acceptanceCriteria": [
        "When the app is in the existing session setup failure state (identity exists, actor is not created, and actor is not fetching) in frontend/src/pages/LoginPage.tsx, the description text displayed to users is exactly: \"Session Setup failed, kindly refresh it.\"",
        "The primary button in this state clearly communicates refreshing (label uses English and matches the intent \"refresh this\") and still triggers a full page reload (window.location.reload()).",
        "No authentication logic, routing logic, or actor initialization logic is changed—only the user-facing text/labels in the failure UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "In the existing session setup failure card (identity present, actor absent, actor not fetching), keep the description text exactly \"Session Setup failed, kindly refresh it.\" and change only the primary button label to a refresh-oriented label (e.g., \"Refresh\" / \"Refresh this\") while keeping the onClick behavior as window.location.reload() and leaving all auth/routing/actor initialization logic unchanged."
        }
      ]
    },
    {
      "id": "REQ-35",
      "summary": "Reorder the tab triggers in Admin and Agent dashboards to make panels easier to reach while preserving all existing panels and behavior.",
      "acceptanceCriteria": [
        "Admin dashboard tabs in frontend/src/pages/admin/AdminDashboardPage.tsx are reordered to a clearer, intentional sequence (keep all existing tabs: Overview, Agents, Master Data, Follow-Ups, Export; only their placement/order changes).",
        "Agent dashboard tabs in frontend/src/pages/agent/AgentDashboardPage.tsx are reordered to a clearer, intentional sequence (keep all existing tabs: Overview, Leads & Owners, Follow-ups; only their placement/order changes).",
        "All tab content still renders the same existing panel components (no panel is removed or replaced).",
        "Tab bar remains responsive (wraps as needed) and all labels remain in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Reorder the existing TabsTrigger entries (tab order only) to a clearer sequence while keeping the same tab values, English labels, and existing TabsContent sections/components intact (no panels removed/replaced) and preserving the responsive tab list behavior via existing classes."
        },
        {
          "path": "frontend/src/pages/agent/AgentDashboardPage.tsx",
          "operation": "modify",
          "description": "Reorder the existing TabsTrigger entries (tab order only) to a clearer sequence while keeping the same tab values, English labels, and existing TabsContent sections/components intact (no panels removed/replaced) and preserving the responsive tab list behavior via existing classes."
        }
      ]
    }
  ]
}